#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```
terraform
Acquiring state lock. This may take a few moments...
openstack_blockstorage_volume_v3.image-cache: Refreshing state... [id=88de8388-28c4-4d9b-bb95-d4c5eb2a83bd]
openstack_compute_instance_v2.image-sync: Refreshing state... [id=5bfc2839-5d5e-48f8-8175-d9481cc17b59]
openstack_compute_volume_attach_v2.attached: Refreshing state... [id=5bfc2839-5d5e-48f8-8175-d9481cc17b59/88de8388-28c4-4d9b-bb95-d4c5eb2a83bd]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # openstack_compute_instance_v2.image-sync must be replaced
-/+ resource "openstack_compute_instance_v2" "image-sync" {
      ~ access_ip_v4        = "192.168.1.199" -> (known after apply)
      + access_ip_v6        = (known after apply)
      ~ all_metadata        = {} -> (known after apply)
      ~ all_tags            = [] -> (known after apply)
      ~ availability_zone   = "nova" -> (known after apply)
      ~ created             = "2026-01-20 11:56:27 +0000 UTC" -> (known after apply)
      ~ flavor_name         = "svc.s" -> (known after apply)
      ~ id                  = "5bfc2839-5d5e-48f8-8175-d9481cc17b59" -> (known after apply)
      ~ image_name          = "ubuntu-22.04-x86_64-raw" -> (known after apply)
        name                = "image-sync"
      + region              = (known after apply)
      - tags                = [] -> null
      ~ updated             = "2026-01-20 11:56:34 +0000 UTC" -> (known after apply)
      ~ user_data           = "381cb00d7dafc4f21148212ba65f1f37591a0e90" -> "8dba7029590ef7bb6cb40b093dcaa18797e1df25" # forces replacement
        # (6 unchanged attributes hidden)

      ~ network {
          ~ fixed_ip_v4    = "192.168.1.199" -> (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          ~ mac            = "fa:16:3e:b9:65:0d" -> (known after apply)
          ~ name           = "cloud_egi_net" -> (known after apply)
          + port           = (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # openstack_compute_volume_attach_v2.attached must be replaced
-/+ resource "openstack_compute_volume_attach_v2" "attached" {
      ~ device      = "/dev/sdb" -> (known after apply)
      ~ id          = "5bfc2839-5d5e-48f8-8175-d9481cc17b59/88de8388-28c4-4d9b-bb95-d4c5eb2a83bd" -> (known after apply)
      ~ instance_id = "5bfc2839-5d5e-48f8-8175-d9481cc17b59" -> (known after apply) # forces replacement
      + region      = (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  ~ instance-id = "5bfc2839-5d5e-48f8-8175-d9481cc17b59" -> (known after apply)

Warning: Argument is deprecated

  with provider["registry.terraform.io/terraform-provider-openstack/openstack"],
  on backend.tf line 10, in provider "openstack":
  10: provider "openstack" {

Users not using loadbalancer resources can ignore this message. Support for
neutron-lbaas will be removed on next major release. Octavia will be the only
supported method for loadbalancer resources. Users using octavia will have to
remove 'use_octavia' option from the provider configuration block. Users
using neutron-lbaas will have to migrate/upgrade to octavia.

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @enolfc, Action: `pull_request`*